Revit 2026 API

# FailuresAccessorIsPending Method

---

Checks if the failure processing is pending.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsPending()
```
```vb
Public Function IsPending As Boolean
```
```cpp
public:
bool IsPending()
```
```fsharp
member IsPending : unit -> bool
```

#### Return Value

Boolean True if the failures processing is in the pending state.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This FailuresAccessor is inactive (is used outside of failures processing). |

The failure processing is pending after failures processor has returned WaitForUserInput and until pending state is finished by either committing or rolling back of the pending transaction.

#### Reference

FailuresAccessor Class

Autodesk.Revit.DB Namespace